flashsim_result/sysbench/ctoc/nontrx_delete_t60.out
2018. 12. 17. (월) 05:19:51 KST
[SYSBENCH] Running benchmark...
sysbench 0.4.12:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 16

Doing OLTP test.
Running non-transactional test
Using Uniform distribution
Using "BEGIN" for starting transactions
Using auto_inc on the id column
Threads started!
Time limit exceeded, exiting...
(last message repeated 15 times)
Done.

OLTP test statistics:
    queries performed:
        read:                            0
        write:                           454979
        other:                           0
        total:                           454979
    transactions:                        454979 (7582.00 per sec.)
    deadlocks:                           0      (0.00 per sec.)
    read/write requests:                 454979 (7582.00 per sec.)
    other operations:                    0      (0.00 per sec.)

Test execution summary:
    total time:                          60.0078s
    total number of events:              454979
    total time taken by event execution: 959.7351
    per-request statistics:
         min:                                  0.12ms
         avg:                                  2.11ms
         max:                                130.83ms
         approx.  95 percentile:              14.87ms

Threads fairness:
    events (avg/stddev):           28436.1875/33.70
    execution time (avg/stddev):   59.9834/0.00

2018. 12. 17. (월) 05:20:51 KST

----------------------------------------------------------------------------


mutex_t : 0x3bb88ea8 q:0x3bb88ea0, size:2048
mutex_t : 0x3bb89478 q:0x3bb89470, size:1024
mutex_t : 0x3bb894d8 q:0x3bb894d0, size:1024
mutex_t : 0x3bb89538 q:0x3bb89530, size:1024
nohost: [dm_nohost_probe] PROBE STARTED
Initializing Connectal & DMA...
subprocess pid 11545 completed status=0 0
[initPortalHardwareOnce:270] fd 5 len 0
[checkSignature:167] read status from '/dev/connectal' was only 0 bytes long
checkSignature: driver 'zynqportal.c' signature mismatch 3431c6f01fcc1c478c8187d1e6992edc e059016ac411386d6e2597d43bc49e15
checkSignature: driver 'portalmem.c' signature mismatch 0ba7c77e370fade81cfa5a0e5abb92f0 eef0fb3bacb31283d694f7aef3d380b3
Main::allocating memory...
USE_ACP = FALSE
USE_ACP = FALSE
Main::allocating memory finished!
[dmaManagerOnce:44]
Requested FCLK[0]=200000000 actually 200000000
Requested Freq: 200.00, Actual Freq: 200.00, status=0
LOG: DEBUG DUMP: gearSend = -393519671, gearRec = 701735683, aurSend = -1648489952, aurRec = 55145343, readSend=-1226933558, writeSend=39300508
nohost: [dm_nohost_probe] PROBE DONE!
nohost: [dm_nohost_open] open done!
!!! print info !!!
Async status: 1
use wirte buffer: 1
Wait same mapping request(FLYING): 0
use gc polling: 0
use eviction polling: 0
# of total block: 512
# of total page: 8388608
page per block: 16384
# of translation block: 2
# of translation page: 32768
# of data block: 508
# of data page: 8323072
# of total cache mapping entry: 4096
max # of ram reside cme: 1024
max # of clean translation cache table: 512
cache percentage: 25.000%
!!! print info !!!
BM_Init() End!
mutex_t : 0x3bba9378 q:0x3bba9370, size:1024
_nos:512
bad_block_checking...[ 99.998474 ]
badblock_cnt: 90
_RNOS:4096
bad block 294912 -> 67092480
bad block 737280 -> 67076096
bad block 770048 -> 67059712
bad block 802816 -> 67043328
bad block 835584 -> 67026944
bad block 1474560 -> 67010560
bad block 1490944 -> 66994176
bad block 1884160 -> 66977792
bad block 2359296 -> 66961408
bad block 4620288 -> 66945024
bad block 5783552 -> 66928640
bad block 5931008 -> 66912256
bad block 6520832 -> 66895872
bad block 6619136 -> 66879488
bad block 8896512 -> 66863104
bad block 9060352 -> 66846720
bad block 9191424 -> 66830336
bad block 11255808 -> 66813952
bad block 12763136 -> 66797568
bad block 13467648 -> 66781184
bad block 13533184 -> 66764800
checking done!
server waiting.....
connected!!!

WAF: 1.58

WAF: 1.58

WAF: 1.52

WAF: 1.49

WAF: 1.47

WAF: 1.46

WAF: 1.45

WAF: 1.45

WAF: 1.44

WAF: 1.44

WAF: 1.43
^C


[cdf]read---
60	2	0.000002
120	3858	0.003243
130	56170	0.050437
140	88487	0.124783
150	52439	0.168842
160	42823	0.204821
170	40033	0.238457
180	32891	0.266091
190	24183	0.286410
200	21477	0.304455
210	20207	0.321432
220	18091	0.336632
230	14096	0.348476
240	12063	0.358611
250	11798	0.368523
260	15767	0.381771
270	32236	0.408855
280	45405	0.447004
290	47073	0.486554
300	47767	0.526688
310	47168	0.566318
320	43807	0.603124
330	40530	0.637177
340	40269	0.671011
350	39722	0.704385
360	37394	0.735803
370	33304	0.763785
380	30741	0.789613
390	28701	0.813728
400	26034	0.835601
410	23538	0.855378
420	20272	0.872410
430	17991	0.887526
440	16031	0.900995
450	14514	0.913190
460	12512	0.923702
470	11129	0.933053
480	9682	0.941187
490	8765	0.948552
500	7577	0.954918
510	6658	0.960512
520	5734	0.965329
530	4964	0.969500
540	4451	0.973240
550	3901	0.976517
560	3318	0.979305
570	2973	0.981803
580	2614	0.983999
590	2320	0.985949
600	2075	0.987692
610	1720	0.989137
620	1514	0.990409
630	1357	0.991549
640	1157	0.992521
650	1024	0.993382
660	902	0.994140
670	789	0.994803
680	693	0.995385
690	604	0.995892
700	503	0.996315
710	446	0.996690
720	424	0.997046
730	360	0.997348
740	302	0.997602
750	288	0.997844
760	247	0.998052
770	229	0.998244
780	183	0.998398
790	173	0.998543
800	128	0.998651
810	128	0.998758
820	115	0.998855
830	88	0.998929
840	94	0.999008
850	74	0.999070
860	53	0.999114
870	51	0.999157
880	44	0.999194
890	42	0.999230
900	38	0.999261
910	28	0.999285
920	33	0.999313
930	30	0.999338
940	23	0.999357
950	18	0.999372
960	20	0.999389
970	23	0.999408
980	8	0.999415
990	12	0.999425
1000	9	0.999433
1010	8	0.999440
1020	8	0.999446
1030	13	0.999457
1040	5	0.999461
1050	5	0.999466
1060	8	0.999472
1070	5	0.999477
1080	5	0.999481
1090	6	0.999486
1100	6	0.999491
1110	4	0.999494
1120	8	0.999501
1130	1	0.999502
1140	2	0.999503
1150	6	0.999509
1160	4	0.999512
1170	3	0.999514
1180	3	0.999517
1190	2	0.999519
1200	1	0.999519
1210	1	0.999520
1220	2	0.999522
1230	1	0.999523
1240	3	0.999525
1250	1	0.999526
1260	2	0.999528
1270	2	0.999529
1280	1	0.999530
1290	4	0.999534
1300	3	0.999536
1310	3	0.999539
1320	1	0.999540
1330	1	0.999540
1340	2	0.999542
1360	1	0.999543
1400	2	0.999545
1410	2	0.999546
1420	5	0.999551
1430	3	0.999553
1450	2	0.999555
1500	1	0.999556
1570	1	0.999556
1630	1	0.999557
1660	1	0.999558
1670	1	0.999559
1680	1	0.999560
1700	1	0.999561
1760	1	0.999561
1840	1	0.999562
1970	3	0.999565
1990	1	0.999566
2010	2	0.999567
2020	3	0.999570
2030	1	0.999571
2040	1	0.999572
2050	1	0.999572
2100	1	0.999573
2110	1	0.999574
2170	3	0.999577
2210	1	0.999577
2220	3	0.999580
2270	2	0.999582
2280	2	0.999583
2290	4	0.999587
2300	2	0.999588
2310	4	0.999592
2320	1	0.999592
2330	3	0.999595
2350	1	0.999596
2360	2	0.999598
2390	3	0.999600
2400	3	0.999603
2410	1	0.999603
2420	2	0.999605
2430	1	0.999606
2440	1	0.999607
2450	1	0.999608
2460	4	0.999611
2490	1	0.999612
2500	1	0.999613
2510	1	0.999614
2520	1	0.999614
2530	3	0.999617
2550	2	0.999619
2570	2	0.999620
2590	1	0.999621
2600	4	0.999624
2610	2	0.999626
2640	2	0.999628
2650	2	0.999629
2660	2	0.999631
2670	2	0.999633
2720	1	0.999634
2730	2	0.999635
2900	3	0.999638
2910	3	0.999640
2920	4	0.999644
2930	2	0.999645
2940	3	0.999648
2950	2	0.999650
2990	1	0.999650
3000	1	0.999651
3010	2	0.999653
3020	1	0.999654
3030	1	0.999655
3040	1	0.999656
3050	1	0.999656
3070	1	0.999657
3080	2	0.999659
3090	3	0.999661
3100	1	0.999662
3110	12	0.999672
3120	5	0.999677
3130	2	0.999678
3140	3	0.999681
3150	1	0.999682
3160	1	0.999682
3170	3	0.999685
3180	4	0.999688
3190	2	0.999690
3200	1	0.999691
3210	4	0.999694
3220	2	0.999696
3230	3	0.999698
3240	5	0.999703
3270	3	0.999705
3280	2	0.999707
3290	1	0.999708
3310	5	0.999712
3320	3	0.999714
3330	4	0.999718
3340	4	0.999721
3350	4	0.999724
3360	1	0.999725
3370	4	0.999729
3380	2	0.999730
3390	1	0.999731
3400	1	0.999732
3410	1	0.999733
3420	4	0.999736
3430	7	0.999742
3440	3	0.999745
3450	1	0.999745
3460	3	0.999748
3470	1	0.999749
3480	6	0.999754
3490	4	0.999757
3500	1	0.999758
3510	1	0.999759
3530	2	0.999761
3540	4	0.999764
3550	2	0.999766
3560	1	0.999766
3590	1	0.999767
3600	1	0.999768
3610	2	0.999770
3630	1	0.999771
3640	3	0.999773
3650	1	0.999774
3660	3	0.999776
3670	3	0.999779
3680	2	0.999781
3690	5	0.999785
3710	2	0.999787
3720	1	0.999787
3730	4	0.999791
3740	3	0.999793
3750	2	0.999795
3770	4	0.999798
3780	6	0.999803
3790	4	0.999807
3800	3	0.999809
3820	3	0.999812
3860	1	0.999813
3930	1	0.999813
3950	1	0.999814
3990	3	0.999817
4010	1	0.999818
4020	1	0.999819
4070	2	0.999820
4090	1	0.999821
4100	2	0.999823
4130	2	0.999824
4140	2	0.999826
4150	1	0.999827
4160	1	0.999828
4180	3	0.999830
4200	1	0.999831
4220	1	0.999832
4230	1	0.999833
4240	1	0.999834
4250	1	0.999834
4270	3	0.999837
4300	1	0.999838
4310	3	0.999840
4320	1	0.999841
4330	1	0.999842
4340	1	0.999843
4370	1	0.999844
4390	1	0.999845
4400	1	0.999845
4410	2	0.999847
4420	2	0.999849
4430	2	0.999850
4440	2	0.999852
4450	3	0.999855
4460	2	0.999856
4470	2	0.999858
4480	1	0.999859
4490	2	0.999861
4500	1	0.999861
4520	2	0.999863
4530	2	0.999865
4540	1	0.999866
4550	2	0.999867
4620	1	0.999868
4630	2	0.999870
4640	1	0.999871
4650	1	0.999871
4660	4	0.999875
4670	3	0.999877
4690	1	0.999878
4700	3	0.999881
4710	1	0.999882
4720	1	0.999882
4730	1	0.999883
4740	2	0.999885
4750	1	0.999886
4770	1	0.999887
4780	3	0.999889
4810	3	0.999892
4830	1	0.999892
4860	3	0.999895
4880	2	0.999897
4930	1	0.999897
4960	2	0.999899
4970	1	0.999900
5160	1	0.999901
5170	1	0.999902
5190	1	0.999903
5500	1	0.999903
5510	1	0.999904
5520	2	0.999906
5550	1	0.999907
5570	3	0.999909
5580	2	0.999911
5630	1	0.999912
5670	3	0.999914
5680	1	0.999915
5690	1	0.999916
5700	1	0.999917
5710	4	0.999920
5720	1	0.999921
5730	2	0.999923
5740	2	0.999924
5760	1	0.999925
5770	2	0.999927
5780	1	0.999928
5920	1	0.999929
5980	1	0.999929
6000	1	0.999930
6070	2	0.999932
6210	1	0.999933
6220	3	0.999935
6250	1	0.999936
6270	1	0.999937
6280	3	0.999940
6310	1	0.999940
6350	1	0.999941
6360	1	0.999942
6370	2	0.999944
6380	1	0.999945
6390	1	0.999945
6450	2	0.999947
6550	1	0.999948
6560	1	0.999949
6590	1	0.999950
6600	1	0.999950
6630	1	0.999951
6640	1	0.999952
6660	2	0.999954
6680	1	0.999955
6750	2	0.999956
6770	2	0.999958
6810	1	0.999959
6820	1	0.999960
6830	2	0.999961
6840	1	0.999962
6850	1	0.999963
6860	2	0.999965
6870	1	0.999966
7150	1	0.999966
7160	2	0.999968
7170	2	0.999970
7180	1	0.999971
7320	2	0.999972
7340	1	0.999973
7400	1	0.999974
7420	1	0.999975
7580	2	0.999976
7590	1	0.999977
7600	2	0.999979
7610	1	0.999980
7630	1	0.999981
8330	1	0.999982
8910	1	0.999982
9060	1	0.999983
9650	1	0.999984
9880	1	0.999985
10050	1	0.999986
10140	1	0.999987
10200	1	0.999987
10340	1	0.999988
10390	1	0.999989
10570	1	0.999990
10940	2	0.999992
10970	1	0.999992
11120	1	0.999993
11230	1	0.999994
11430	1	0.999995
11750	1	0.999996
11840	1	0.999997
11930	1	0.999997
12130	1	0.999998
12360	1	0.999999
12430	1	1.000000
a_type	l_type	max	min	avg	cnt	percentage
0	0	57	0	3.848	46	0.00386%
1	0	10574	120	176.508	486117	40.84317%
2	0	12437	249	799.348	512	0.04302%
3	0	7590	135	366.110	351229	29.50998%
8	0	2	1	1.125	16	0.00134%
9	0	7223	119	177.028	352351	29.60425%
--------------------------------------------
|            bench type:                   |
--------------------------------------------
----algorithm----
[0~100(usec)]: 0
[100~200(usec)]: 0
[200~300(usec)]: 0
[300~400(usec)]: 0
[400~500(usec)]: 0
[500~600(usec)]: 0
[600~700(usec)]: 0
[700~800(usec)]: 0
[800~900(usec)]: 0
[900~1000(usec)]: 0
[over_ms]: 0
[over__s]: 0
----lower----
[0~100(usec)]: 0
[100~200(usec)]: 0
[200~300(usec)]: 0
[300~400(usec)]: 0
[400~500(usec)]: 0
[500~600(usec)]: 0
[600~700(usec)]: 0
[700~800(usec)]: 0
[800~900(usec)]: 0
[900~1000(usec)]: 0
[over_ms]: 0
[over__s]: 0
----average----
[avg_algo]: 0.0
[avg_low]: 0.0
-----lower_info----
[write_op]: 0
[read_op]: 0
[trim_op]:0
[WAF, RAF]: 0.000000, 0.000000
[if rw test]: 0.000000(WAF), 0.000000(RAF)
[all write Time]:0.0
[all read Time]:0.0

----summary----
[all_time]: 0.0
[size]: 79349.015625(mb)
[FAIL NUM] 0
[SUCCESS RATIO] 1.000000
[throughput] inf(kb/s)
             inf(mb/s)
[cache hit cnt,ratio] 8265475, 6.944587
[cache hit cnt,ratio dftl] 8265475, 0.813803
[READ WRITE CNT] 1190204 8966403
error cnt:153
result of ms:
---
bye bye!
# of gc: 30
# of translation page gc: 30
# of data page gc: 0
# of translation page gc w/ data page gc: 0
# of translation page gc w/ read op: 0
# of evict: 862761
# of buf hit: 2
!!! print info !!!
BH: buffer hit, H: hit, R: read, MC: memcpy, CE: clean eviction, DE: dirty eviction, GC: garbage collection
a_type--->>> 0: BH, 1: H
2: R & MC, 3: R & CE & MC
4: R & DE & MC, 5: R & CE & GC & MC
6: R & DE & GC & MC
!!! print info !!!
Cache hit on read: 838505
Cache miss on read: 351741
Cache hit on write: 7426970
Cache miss on write: 453734

Clean hit on read: 698781
Dirty hit on read: 176068
Clean hit on write: 58310
Dirty hit on write: 7368660

% of miss : 0.08
# Clean eviction: 351229
# Dirty eviction: 511532

Clean eviciton on read: 351229
Dirty eviction on read: 0
Clean eviction on write: 0
Dirty eviction on write: 511532

Dirty eviction ratio: 59.29%
Dirty eviction ratio on read: 0.00%
Dirty eviction ratio on write: 100.00%

WAF: 1.43

0 30
1 802500
2 511532
3 1979
4 1979
5 1190202
6 7880704
7 0
8 0
bdbm_mt max: 0
nohost: Wait for all the on-going jobs to finish...
nohost: [dm_nohost_close] MAP Download from HW!
nohost: [dm_nohost_close] closed!
write_q_hit:179561	read_q_hit:0	retry_hit:0